[
  {
    "path": "labs/2024-05-12-beans/",
    "title": "The Bean Experiment",
    "description": "adapted from an exercise by Barry Sinervo",
    "author": [],
    "date": "2024-05-13",
    "categories": [],
    "contents": "\nPicture yourself as an early farmer 9000 years ago planting a field of beans. You have your beans in a leather pouch hanging at your side, you reach in, grab a few beans letting them filter through your fingers until you have a single bean which you drop into a hole you have just\nmade with your staff. You cover that hole with your foot and thm move a few feet further down the row and poke another hole in the ground for the next seed.\nNow, you are not consiously doing anything to improve your crop. You are not selecting beans of a particular type or size. You simply have a pouch of beans that you are planting. Given this assumption, what do you predict would be the pattern of the bean size over time? Do you expect the beans you have at the beginning of your planting season to be the same size as the beans you have at the end of your planting season? If, not, how do you expect them to differ? If you do not thing your remaining beans are a random subset of your starting beans, what is the basis for your expectation? Make null and alternative hypotheses for the pattern of bean size over time.\nPart 1\nGet a bag of approximately 200 beans.\nReach into the bag and pick up approximately 5-10 beans with our fingers and roll them around with your fingers until you have only 1. Set this bean aside in “lot 1”. Repeat this procedure until there are 10 beans in “lot 1”. Place these beans in a weighing boat labeled lot 1.\nCreate 20 such lots in sequence, weigh each lot, and divide by the number of beans to get the mean weight of beans in each lot. Record your data in a table. Your table should have a column for “lot” and a column for “trial1_weights” in an excel file called “bean_data.xlsx”.\nPart 2\nSpread your bean boats on the table in front you and dump them out. Now play the part of the farmer purposefully trying to improve the crop by selecting the largest beans to plant first. How does this change your expectation of the pattern of bean size over time? Sort your beans into lots with your preferred beans in the earliest lots and your least preferred beans in your later lots. Reweigh your lots and record your data in a new column called “trial2_weights”.\nPart 3\nLoad necessary packages for your data analysis\n\n\nlibrary(readxl)\nlibrary(ggplot2)\nlibrary(ggpmisc)\nlibrary(see)\nlibrary(patchwork)\nlibrary(performance)\n\n\nRead in your data file\n\n\n# Load data\n#data <- read_excel(\"bean_data.xlsx\")\n\n# Create the lot numbers\nlot <- seq(1:20)\n\n# Create trial 1 weights\ntrial1_weights <- c(1.2, 1.1, 0.9, 1, 0.9, 0.85, 0.9, 0.7, 0.75, 0.8, \n                    0.7, 0.65, 0.6, 0.65, 0.6, 0.57, 0.5, 0.55, 0.5, 0.5)\n\n# Create trial 2 weights\ntrial2_weights <- c(1.2, 1.1, 1, 0.9, 0.9, 0.9, 0.85, 0.8, 0.75, 0.7, \n                    0.7, 0.65, 0.65, 0.6, 0.6, 0.57, 0.55, 0.5, 0.5, 0.5)\n\n# Combine into a dataframe\nmydata <- data.frame(lot = lot, \n                   trial1_weights, \n                   trial2_weights)\n\n\nPlot your data\n\n\n\nNow lets generate a linear model.\n\n\n# Fit linear regression\nlm_model <- lm(`trial1_weights` ~ lot, data = mydata)\n\n\nModel evaluation\nBefore moving on, we should consider whether a linear regression was appropriate for these data by checking the plots below and critically evaluting them. Are there any major issues?\n\n\n# Check model assumptions\ncheck_model(x=lm_model, check=\"normality\")\n\n\ncheck_model(x=lm_model, check=\"linearity\")\n\n\ncheck_model(x=lm_model, check=\"homogeneity\")\n\n\ncheck_model(x=lm_model, check=\"outliers\")\n\n\n\nProceed with the model\nNow lets look at the model output\n\n\n#evaluate the linear model\nsummary(lm_model)\n\n\nCall:\nlm(formula = trial1_weights ~ lot, data = mydata)\n\nResiduals:\n      Min        1Q    Median        3Q       Max \n-0.128293 -0.044440  0.003586  0.039102  0.141286 \n\nCoefficients:\n             Estimate Std. Error t value Pr(>|t|)    \n(Intercept)  1.091632   0.030288   36.04  < 2e-16 ***\nlot         -0.032917   0.002528  -13.02 1.34e-10 ***\n---\nSignif. codes:  0 '***' 0.001 '**' 0.01 '*' 0.05 '.' 0.1 ' ' 1\n\nResidual standard error: 0.0652 on 18 degrees of freedom\nMultiple R-squared:  0.904, Adjusted R-squared:  0.8987 \nF-statistic: 169.5 on 1 and 18 DF,  p-value: 1.344e-10\n\nIs the slope of the regression line through the data from your first trial non-zero? Is it significantly different from zero at the alpha=0.05 level? Do we reject or fail to reject your null hypothesis?\nOkay, now lets look at the plot below. How can you explain this pattern light of your alternative hypothesis? Don’t forget to report the linear equation, the \\(r^2\\) value, and the p-value for each regression.\n\n\n# Extract coefficients\nintercept <- coef(lm_model)[1]\nslope <- coef(lm_model)[2]\n\n# Create equation text\nequation_text <- paste(\"y =\", round(intercept, 2), \"+\", round(slope, 2), \"x\")\n\n# Plot trial 1 weights against lot number\n# Create the plot without stat_regline_equation\nplot_trial1 <- ggplot(mydata, aes(x = lot, y = `trial1_weights`)) +\n  geom_point() +\n  geom_smooth(method = \"lm\", se = TRUE) +\n  labs(title = \"Trial 1 Weights vs. Lot Number\",\n       x = \"Lot Number\",\n       y = \"Trial 1 Weights\")\n\n# Add equation annotation to the plot\nplot_trial1 <- plot_trial1 +\n  annotate(\"text\", x = max(mydata$lot), y = max(mydata$trial1_weights), \n           label = equation_text, hjust = 1, vjust = 1) +\n  annotate(\"text\", x = max(mydata$lot), y = max(mydata$trial1_weights), \n           label = \"R^2 = value\", hjust = 1, vjust = 3)\n\n# Plot trial 2 weights against lot number\nplot_trial2 <- ggplot(mydata, aes(x = lot, y = `trial2_weights`)) +\n  geom_point() +\n  labs(title = \"Trial 2 Weights vs. Lot Number\",\n       x = \"Lot Number\",\n       y = \"Trial 2 Weights\")\n\n# Display plots\nplot_trial1\n\n\nplot_trial2\n\n\n\nThe lab report\nYour lab report should begin with a brief review of the literature about evolution of seed size during the early stages of agriculture. I ahve provided two sources to get you started (Darwin 1859 Ch. 4; Heiser, 1988, and Smith 2006).\nRead these and structure an introduction that sets up a test of the hypothesis that unconscious selection for bean size exists based on your data and the class data.\nDescribe your methods in sufficient detail tat you could give them to another student and the would be able to replicate the experiment and statistical analysis of the data.\nDescribe your results and refer to your figures.\nWrite a discussion that begins with an assessment of unconscious selection as a driver of the evolution of seed size in early agriculture. Then, consider how selection might drive the evolution of seed size in other ecological contexts and propose future investigations.\nLearn more about using Distill for R Markdown at https://rstudio.github.io/distill.\n\n\n\n",
    "preview": "labs/2024-05-12-beans/distill-preview.png",
    "last_modified": "2024-05-13T16:07:56-05:00",
    "input_file": {}
  },
  {
    "path": "labs/2024-05-12-populationgrowth/",
    "title": "Population growth 1",
    "description": "introduction to population growth",
    "author": [],
    "date": "2024-05-13",
    "categories": [],
    "contents": "\n\n\n\nIntroduction to Population Growth Models\nIn ecology, understanding how populations may change over time is crucial. Two common models used to describe population growth are the exponential growth model of density-independent population growth and the logistic growth model fo density-dependent population growth.\nExponential Population Growth\nExponential growth occurs when a population increases by a constant proportion over a fixed time period. It is often described by the equation:\n\\[\nN_t=N_0×e^{rt}\n\\]\nWhere:\n\\(N_t\\) is the population size at time \\(t\\).\n\\(N_0\\) is the initial population size.\n\\(r\\) is the per capita rate of increase; also called the per capita growth rate, or instantaneous rate of increase.\n\\(e\\) is the base of the natural logarithm.\nLet’s visualize exponential population growth using R and ggplot2:\n\n\n# Define parameters\nN0 <- 100 # Initial population size\nr <- 0.1 # Growth rate\ntime <- seq(0, 50, by = 1) # Time period\n\n# Calculate population size\nNt <- N0 * exp(r * time)\n\n# Create data frame\ndf <- data.frame(time, Nt)\n\n# Plot\nggplot(df, aes(x = time, y = Nt)) +\n  geom_line(color = \"blue\") +\n  labs(title = \"Exponential Population Growth\",\n       x = \"Time\",\n       y = \"Population Size\") +\n  theme_bw()\n\n\n\nAs you can see in the figure above, exponential growth results in a continuously increasing population size as time proceeds.\nLogistic Population Growth\nLogistic growth takes into account limiting factors that might depress the per-capita birth rate, increase the per-capita death rate, or both as populaiton density increases. Possible factors often include limited resource availability. The logistic growth model is described by the equation:\n\\[\n{dN/dt}=rN(1-{N/K})\n\\]\nWhere:\n\\(dN/dt\\) represents the rate of change of the population over time.\n\\(N\\) is the population size.\n\\(r\\) is the intrinsic per capita growth rate, just as before.\n\\(K\\) is the carrying capacity.\nLet’s visualize logistic population growth using R and ggplot2:\n\n\n# Define parameters\nK <- 500 # Carrying capacity\n\n# Define logistic growth function\nlogistic_growth <- function(N, r, K) {\n  r * N * (1 - (N / K))\n}\n\n# Simulate logistic growth\nsimulated_data <- data.frame(time = time)\nsimulated_data$Nt <- NA\n\nN <- N0\nfor (i in 1:length(time)) {\n  dNdt <- logistic_growth(N, r, K)\n  N <- N + dNdt\n  simulated_data$Nt[i] <- N\n}\n\n# Plot\nggplot(simulated_data, aes(x = time, y = Nt)) +\n  geom_line(color = \"forestgreen\") +\n  labs(title = \"Logistic Population Growth\",\n       x = \"Time\",\n       y = \"Population Size\")\n\n\n\nIn the figure above, you can observe logistic population growth. Initially, the population grows exponentially, but as it approaches the carrying capacity, the growth rate slows down until it stabilizes near the carrying capacity.\nDensity-Dependent Changes in Birthrate and Death Rate\nTo think a bit more about where carrying capacity comes from, we can decouple the density-dependence of per-capita birth and death rates in the logistic growth model. In general at small population sizes when resources are abundant, birth rates are high and death rates are low. This resulting in rapid population growth. However, as the population grows competition for resources increases, leading to decreased birth rates and increased death rates. We can model these changes as linear functions, or more complex relationships, but when the per-capita birth rates and death rates balance out, the system is at carrying capacity.\n\\[b = b_0 − aN\\]\n\\[d = d_0 + cN\\]\n\n\n# Define population size and parameters\npopulation_size <- seq(0, 500, by = 10) # Population size\nper_capita_birth_rate <- 0.2 - 0.0001 * population_size # Declining per-capita birth rate\nper_capita_death_rate <- 0.1 + 0.0002 * population_size # Increasing per-capita death rate\n\n# Calculate net growth rate (birth rate - death rate)\nnet_growth_rate <- per_capita_birth_rate - per_capita_death_rate\n\n# Create data frame\ndf <- data.frame(population_size, per_capita_birth_rate, per_capita_death_rate)\n\n# Find intersection point\nintersection <- which.min(abs(per_capita_birth_rate - per_capita_death_rate))\n\n# Calculate carrying capacity\ncarrying_capacity <- population_size[intersection]\n\n# Plot\nggplot(df, aes(x = population_size)) +\n  geom_line(aes(y = per_capita_birth_rate, color = \"Per-capita Birth Rate\")) +\n  geom_line(aes(y = per_capita_death_rate, color = \"Per-capita Death Rate\")) +\n  geom_vline(xintercept = carrying_capacity, linetype = \"dashed\", color = \"black\") +\n  labs(title = \"Changing Birth and Death Rates\",\n       x = \"Population Size\",\n       y = \"Per-capita Rate\") +\n  scale_color_manual(values = c(\"Per-capita Birth Rate\" = \"blue\", \"Per-capita Death Rate\" = \"red\")) +\n  theme_minimal() +\n  theme(legend.position = \"none\")\n\n\n\nIn the plot above, you can see how the declining per-capita birth rate (blue) and increasing per-capita death rate (red) interact to set the carrying capacity (dashed red vertical line), where the net growth rate (black dashed horizontal line) becomes zero.\nAllee effect\nThe Allee effect is a positive relation between average fitness and population size at low population densities (Drake and Kramer 2011). This means there is a positive relationship between the per capita birth rate rate and population size. This can result in positive density dependence rather than negative density dependence and typically happens at very low population sizes.\nAllee effects can occur in populations of obligate outcrossers because at very low population sizes, male and female individuals are less likely to encounter each other or be pollinated by the same pollinator, and so mating frequency is very low. As population size increases, individuals are more likely to encounter each other, and mating increases.\nWe can model this by adding a term to our model, which incorporates a threshold population size \\(a\\), below which the population growth rate is negative.\n\n\n## for simplicity, we let r=1 so we can ignore it here.\npgrA <- function(N, alpha, a, tau){ N*(1-alpha*N)*(1-(a+tau)/(N+tau)) }\nmyData <- data.frame( N=c(0, 110) ) # ggplot requires a data frame\np <- ggplot(data=myData, aes(x=N)) + # set the basic properties of the plot\n  # in the stat_function, we indicate the parameters in our equation.\n    stat_function(fun=pgrA, geom=\"line\", n=1001,\n                  args=list(alpha = 0.01, a=20, tau=.1)) + \n  labs(y=\"Population growth rate (dN/dt)\", x=\"Population size (N)\") + \n  #theme_classic() + \n  geom_hline(yintercept=0, lty=3)+\n  scale_x_continuous(expand = c(0, 0)) \np\n\n\n\nIn the plot above, you can see the non-linear birth rate (blue) with Allee effects, where the birth rate starts low, increases with population size, and then declines as competition depresses birth rates, The carrying capacity is denoted by the dashed vertical black line.\nMonod equation\nSometimes, microbial population growth in a limited nutrient environment is modeled with Monod’s equation. It describes the relationship between the specific growth rate of the microorganism and the concentration of a limiting nutrient in the environment. Monod’s equation assumes that growth rate increases as the concentration of the limiting nutrient increases until it reaches a maximum growth rate (maximum specific growth rate). Beyond this point, the growth rate becomes constant even if the nutrient concentration continues to increase.\nLearning Objectives:\nUnderstand Monod’s equation and its application in describing microbial growth.\nLearn about the parameters of Monod’s equation and their significance.\nVisualize the relationship between growth rate and substrate concentration using ggplot2.\nThe Monod model assumes growth is balanced, there is no inhibition caused by metabolism products, and the organisms are planktonic in Newtonian fluids that are not very viscous.\nTypically, microbial growth consists of a lag phase, a log phase, a stationary phase, and a death or decline phase.\n\n\n# Define Monod's equation\nmonod <- function(S, mu_max, Ks) {\n  mu <- mu_max * (S / (Ks + S))\n  return(mu)\n}\n\n\nGenerate substrate concentrations\n\n\nS <- seq(0, 100, by = 1) # Substrate concentration range\n\n# Set parameter values\nmu_max <- 0.5  # Maximum specific growth rate (per time unit)\nKs <- 20       # Half-saturation constant (substrate concentration at half the maximum growth rate)\n\n# Calculate growth rates using Monod's equation\ngrowth_rate <- monod(S, mu_max, Ks)\n\n# Create dataframe for plotting\nmonod_data <- data.frame(S = S, Growth_Rate = growth_rate)\n\n# Plot Monod curve\nggplot(data = monod_data, aes(x = S, y = Growth_Rate)) +\n  geom_line(color = \"blue\") +\n  labs(x = \"Substrate Concentration\", y = \"Growth Rate\", \n       title = \"Monod's Equation: Microbial Growth Rate vs Substrate Concentration\") +\n  theme_minimal() +\n  geom_vline(xintercept = Ks, linetype = \"dashed\", color = \"red\") +\n  annotate(\"text\", x = Ks + 5, y = 0.4, label = \"Ks\", color = \"red\") +\n  annotate(\"text\", x = 80, y = 0.4, label = expression(mu[Max] == 0.5), color = \"blue\")\n\n\n\nThe Monod model consists of a few parameters.\n\\[µ = µ_{max} × {S}/{(K_s + S)}\\]\n\\(µ\\) Represents the specific growth rate of the microorganisms\nThe maximum specific growth rate (\\(µ_{max}\\)) represents the intrinsic growth potential of the microorganism under optimal conditions.\nThe half-saturation constant (\\(K_s\\)) is the substrate concentration at which the specific growth rate is half of the maximum. It indicates the affinity of the microorganism for the substrate.\nThe substrate concentration (\\(S\\)) affects the specific growth rate according to the Michaelis-Menten kinetics.\nIn this first model, we will assume substrate concentration is constant \\(S_0\\)\nIt is also possible for two different nutrients limiting growth such as Carbon, Nitrogen, or others.\n\\[µ = µ_{max} × {S_1}/{(K_{s1} + S_1)} × {S_2}/{(K_{s2} + S_1)}\\]\nReflective Questions:\nWhat does Monod’s equation describe, and what are its main assumptions?\nHow do changes in the parameter values affect the shape of the Monod curve?\nCan you identify situations in real-world environments where Monod’s equation might be applicable?\nHow might deviations from Monod’s equation occur in complex microbial communities?\nHow does the shape of the Monod curve change with different parameter values of mu_max and Ks?\nWhat does the half-saturation constant (Ks) represent in Monod’s equation, and why is it important in microbial growth kinetics?\nCan you think of examples where Monod’s equation might not accurately describe microbial growth dynamics? What factors could influence deviations from Monod kinetics?\n\n\n\n",
    "preview": "labs/2024-05-12-populationgrowth/distill-preview.png",
    "last_modified": "2024-05-13T21:36:47-05:00",
    "input_file": {}
  },
  {
    "path": "labs/2024-05-13-competition/",
    "title": "Competition",
    "description": "Competition with Lotka-Volterra models",
    "author": [
      {
        "name": "Nathan Jud",
        "url": {}
      }
    ],
    "date": "2024-05-13",
    "categories": [],
    "contents": "\nLearning Objectives:\nUnderstand the basics of constructing a phase plane diagram for a Lotka-Volterra style model.\nDifferentiate between intraspecific and interspecific competition in ecological systems.\nIdentify zero net growth isoclines and their significance in population dynamics.\nExplore the concept of niche and its relationship with the assumptions of the Lotka-Volterra model.\nIntroduce multi-species coexistence models as an extension of Lotka-Volterra.\nPreparation Questions:\nWhat are the key differences between intraspecific and interspecific competition?\nHow do zero net growth isoclines help us understand the stability of population dynamics?\nIn what ways do the assumptions of the Lotka-Volterra model simplify real-world ecological systems?\nCan you think of examples where species coexist in an ecosystem despite competing for the same resources?\nHow might adding more species to the Lotka-Volterra model affect its complexity and predictive power?\n\n\n\n\n\n\n\n\n\nReflective Questions:\nWhat do the zero net growth isoclines represent in this diagram?\nHow do the trajectories of species populations change over time?\nWhat does this indicate about their interactions?\nHow might changes in parameter values alter the stability of the system depicted in the phase plane diagram?\nConsider real-world ecosystems. Can you think of situations where the assumptions of the Lotka-Volterra model might not hold true?\nHow would you extend this model to include more than two competing species?\nWhat challenges might arise in such a scenario?\nThis could be a different post.\nMonod’s equation\nRecall that the Monod models is a common model to predict microorganism growth.\n\n\n\nContois model of competition\nThe Contois model is a classic model used to describe microbial growth in a chemostat environment, where bacteria are competing for limited resources. In this model, the growth rate of a species is proportional to the resource uptake rate and inversely proportional to the concentration of the limiting resource.\n\n\n# Function to simulate Contois model\ncontois_model <- function(X, mu_max, Ks, Yxs, S) {\n  # X: Biomass concentration\n  # mu_max: Maximum specific growth rate\n  # Ks: Half-saturation constant\n  # Yxs: Yield coefficient\n  # S: Substrate concentration\n  \n  mu = mu_max * S / (Ks + S)\n  dXdt = mu * X\n  return(dXdt)\n}\n\n\nNow lets set some simulation parameters\n\n\n\n\n\n\nThis plot above simulates the biomass dynamics for two bacterial species (Species 1 and Species 2) competing for a single limiting resource over time under the Contois model.\n\n\n\n\n\n\n",
    "preview": "labs/2024-05-13-competition/competition_files/figure-html5/unnamed-chunk-3-1.png",
    "last_modified": "2024-05-13T21:37:49-05:00",
    "input_file": {}
  },
  {
    "path": "labs/2024-05-13-microbialgrowth/",
    "title": "Microbial growth",
    "description": "introduction to microbial growth using Monod's equation",
    "author": [],
    "date": "2024-05-13",
    "categories": [],
    "contents": "\n\n\n\nMonod equation\nSometimes, microbial population growth in a limited nutrient environment is modeled with Monod’s equation. It describes the relationship between the specific growth rate of the microorganism and the concentration of a limiting nutrient in the environment. Monod’s equation assumes that growth rate increases as the concentration of the limiting nutrient increases until it reaches a maximum growth rate (maximum specific growth rate). Beyond this point, the growth rate becomes constant even if the nutrient concentration continues to increase.\nLearning Objectives:\nUnderstand Monod’s equation and its application in describing microbial growth.\nLearn about the parameters of Monod’s equation and their significance.\nVisualize the relationship between growth rate and substrate concentration using ggplot2.\nThe Monod model assumes growth is balanced, there is no inhibition caused by metabolism products, and the organisms are planktonic in Newtonian fluids that are not very viscous.\nTypically, microbial growth consists of a lag phase, a log phase, a stationary phase, and a death or decline phase.\n\n\n# Define Monod's equation\nmonod <- function(S, mu_max, Ks) {\n  mu <- mu_max * (S / (Ks + S))\n  return(mu)\n}\n\n\nGenerate substrate concentrations\n\n\nS <- seq(0, 100, by = 1) # Substrate concentration range\n\n# Set parameter values\nmu_max <- 0.5  # Maximum specific growth rate (per time unit)\nKs <- 20       # Half-saturation constant (substrate concentration at half the maximum growth rate)\n\n# Calculate growth rates using Monod's equation\ngrowth_rate <- monod(S, mu_max, Ks)\n\n# Create dataframe for plotting\nmonod_data <- data.frame(S = S, Growth_Rate = growth_rate)\n\n# Plot Monod curve\nggplot(data = monod_data, aes(x = S, y = Growth_Rate)) +\n  geom_line(color = \"blue\") +\n  labs(x = \"Substrate Concentration\", y = \"Growth Rate\", \n       title = \"Monod's Equation: Microbial Growth Rate vs Substrate Concentration\") +\n  theme_minimal() +\n  geom_vline(xintercept = Ks, linetype = \"dashed\", color = \"red\") +\n  annotate(\"text\", x = Ks + 5, y = 0.4, label = \"Ks\", color = \"red\") +\n  annotate(\"text\", x = 80, y = 0.4, label = expression(mu[Max] == 0.5), color = \"blue\")\n\n\n\nThe Monod model consists of a few parameters.\n\\[µ = µ_{max} × {S}/{(K_s + S)}\\]\n\\(µ\\) Represents the specific growth rate of the microorganisms\nThe maximum specific growth rate (\\(µ_{max}\\)) represents the intrinsic growth potential of the microorganism under optimal conditions.\nThe half-saturation constant (\\(K_s\\)) is the substrate concentration at which the specific growth rate is half of the maximum. It indicates the affinity of the microorganism for the substrate.\nThe substrate concentration (\\(S\\)) affects the specific growth rate according to the Michaelis-Menten kinetics.\nIn this first model, we will assume substrate concentration is constant \\(S_0\\)\nIt is also possible for two different nutrients limiting growth such as Carbon, Nitrogen, or others.\n\\[µ = µ_{max} × {S_1}/{(K_{s1} + S_1)} × {S_2}/{(K_{s2} + S_1)}\\]\nReflective Questions:\nWhat does Monod’s equation describe, and what are its main assumptions?\nHow do changes in the parameter values affect the shape of the Monod curve?\nCan you identify situations in real-world environments where Monod’s equation might be applicable?\nHow might deviations from Monod’s equation occur in complex microbial communities?\nHow does the shape of the Monod curve change with different parameter values of mu_max and Ks?\nWhat does the half-saturation constant (Ks) represent in Monod’s equation, and why is it important in microbial growth kinetics?\nCan you think of examples where Monod’s equation might not accurately describe microbial growth dynamics? What factors could influence deviations from Monod kinetics?\n\n\n\n",
    "preview": "labs/2024-05-13-microbialgrowth/distill-preview.png",
    "last_modified": "2024-05-13T21:44:09-05:00",
    "input_file": {}
  }
]
